shutdown -r now # выключить, r-перезагрузить

#навигация
pwd #где я?
cd [куда] #переход по указанному пути
ls -la # что в текущей папке? l-подробнее, а-скрытые

#работа с данными
echo [что] #вывод текста
cat | more | less [файл] #просмотр файла
touch [файл] #создать|обновить файл
cp -v -r [откуда] [куда] #копировать файл, v-показать процесс копирования,r-для папок
rm -r [что] [откуда] #удалить файл, r-для папок
mv [что] [куда] #переместить или переименовать
mkdir -p [имя] #создать директорию, p-вложенные директории
ln -s [на что] [путь и имя] #создает синхронный дубликат,s-создает ссылку
wc [файл] #выдаёт кол-во строк,слов и символов
sort -n [файл] #сортирует содержимое и вываодит, -n сортировка по номерам
cut -d "[делитель]" -f [номер] [файл] #выводит часть файла

#диагностика 
uptime #время работы
uname -a #информация о дистрибутиве
lscpu #информация о процессоре
ping [адрес]#отправка тестовых запросов по домену,ip
ps #запущенные процессы пользователя
top #процессы на компенсации
free -h #показывает память

#поиск
echo $PATH | whereis | locate #список директорий с исполняемыми командами
man -k  | whatis | info [команда] #информация о команде, k-поиск команды по части имени
find [где] -name "[файл]" #поиск файла по имени 
grep [что] [где] #поиск слов в файлах 

#регулярные выражения
-i #игнорировать высоту

#хоткеи
ctrl+alt+f3|f4|f5 #открыть новую сессию терминала
f7 #выход из сессии терминала
ctrl+c #прервать процесс
ctrl+z #переместить процесс на бэк
fg # вернуть процесс с бэка
Tab #автодополнение

#перенаправление данных
[команда] | [команда2] #пайп, пересылка вывода команды на вход другой
[команда] > [куда] #отправка результата команды в файл,создаст или перезапишет, поток без ошибок
[команда] >> [куда] #добавит к существующему в конец, не перезапишет
[команда] 2> [куда] #перенаправления потока ошибок /dev/null
[команда] &> [куда] # запишет и ошибки,и успех одновременно

#архивирование
tar cf [файл] [что архивировать] #архивирует в 1 файл, без компрессии
    tf [файл] #посмотреть что внутри
    xf [файл] #распаковать
    cjf [файл] [что арх.] #прхивирует со зжатием
bzip2 [файл] #скомпрессировать
bunzip2 [файл] #раскомпрессировать

#прльзователи
whoami #имя пользователя
su [имя] #перейти на другого пользователя
id [имя]  #инфа о пользователе и его группах
Last #список входов в систему
who (w) #кто сейчас залогинен
sudo useradd -m [имя] #создать пользователя, m с домашней папкой
sudo passwd [имя] #задать пароль пользователю
sudo userdel -r [имя] #удалить юзера, r - вместе с папкой
sudo groupadd [имя] #создать группу
sudo groupdel [имя] #удалить группу
sudo usermod -aG [группа] [имя] #добавить юзера в группу
sudo deluser [имя] [группа] #удалить пользователя из группы

#файловая система
/var/log #логи системы
/etc/passwd #списки пользователей
/etc/shadow #пароли пользователей
/etc/skel #шаблон папки пользователя
/etc/group #списки групп

#изменение прав доступа
chown [юзер] [файл] #изменить владельца файла
chgtp [группа] [файл] #изменить группу файла
chmod 1777 [файл] #изменитьправа доступа
# 1 - только для папки (1,0) запрещает удаление не своих файлов
# 7 = 4+2+1, стение+запись+исполнение

#сеть
ifconfig | ip addr show #информация о сетях
route #информация о пересылке пакетов
ping [адрес] #пингует по ip или домену
host [адрес] | dig #дает ip по домену
netstat #информация о портах и подключениях 
